### ООП
#### Космический корабль (часть 1)🚀
# Реализовать класс космического корабля. 
# Класс содержит в себе следующие поля: скорость, объем топливного бака, объем грузового отсека, название.  
# Космический корабль может выводить о себе информацию отдельной функцией.

#### Космический корабль (часть 2) - полеты
# Добавить космическому кораблю показатель текущего запаса топлива и расхода на километр. 
# Добавить функцию заправки определенного объема топлива. 
# Добавить функцию полета на определенное расстояние. 
# Не забудь, что мы не можем заправить сверх объема бака, а также не можем лететь без топлива. 
# Пускай функция полета выводит предупреждение о том, что мы не можем лететь, так как нам не хватит топлива на заданное расстояние.

#### Космический корабль (часть 3) - координаты
# Добавить кораблю текущие координаты по двум осям. 
# Модифицировать функцию полета: теперь она принимает координаты полета, вместо точного расстояния. 
# Придется вспомнить уроки математики, ведь тут придется искать расстояние между двумя точками.😏

class Spaceship:
    def __init__(self, name, speed, tonnage, fuel):
        self.name = Soyuz
        self.speed = 40000
        self.tonnage = 200
        self.fuel = 1500

    def ttx(self):
        print(Spaceship.name)

ttx()
